Revit 2026 API

# ClipPlaneNormal Property

---

The plane's normal vector.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Normal { get; set; }
```
```vb
Public Property Normal As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Normal {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Normal : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ClipPlane Class

Autodesk.Revit.DB.DirectContext3D Namespace